espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MR21/Include/efr32mr21_rtcc.h
/**************************************************************************//**
 * @file
 * @brief EFR32MR21 RTCC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32MR21_RTCC_H
#define EFR32MR21_RTCC_H
#define RTCC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32MR21_RTCC RTCC
 * @{
 * @brief EFR32MR21 RTCC Register Declaration.
 *****************************************************************************/

/** RTCC CC Register Group Declaration. */
typedef struct {
  __IOM uint32_t CTRL;                               /**< CC Channel Control Register                        */
  __IOM uint32_t OCVALUE;                            /**< Output Compare Value Register                      */
  __IM uint32_t  ICVALUE;                            /**< Input Capture Value Register                       */
} RTCC_CC_TypeDef;

/** RTCC Register Declaration. */
typedef struct {
  __IM uint32_t   IPVERSION;                    /**< IP VERSION                                         */
  __IOM uint32_t  EN;                           /**< Module Enable Register                             */
  __IOM uint32_t  CFG;                          /**< Configuration Register                             */
  __IOM uint32_t  CMD;                          /**< Command Register                                   */
  __IM uint32_t   STATUS;                       /**< Status register                                    */
  __IOM uint32_t  IF;                           /**< RTCC Interrupt Flags                               */
  __IOM uint32_t  IEN;                          /**< Interrupt Enable Register                          */
  __IOM uint32_t  PRECNT;                       /**< Pre-Counter Value Register                         */
  __IOM uint32_t  CNT;                          /**< Counter Value Register                             */
  __IM uint32_t   COMBCNT;                      /**< Combined Pre-Counter and Counter Valu...           */
  __IM uint32_t   SYNCBUSY;                     /**< Synchronization Busy Register                      */
  __IOM uint32_t  LOCK;                         /**< Configuration Lock Register                        */
  RTCC_CC_TypeDef CC[3U];                       /**< Capture/Compare Channel                            */
  uint32_t        RESERVED0[1003U];             /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_SET;                /**< IP VERSION                                         */
  __IOM uint32_t  EN_SET;                       /**< Module Enable Register                             */
  __IOM uint32_t  CFG_SET;                      /**< Configuration Register                             */
  __IOM uint32_t  CMD_SET;                      /**< Command Register                                   */
  __IM uint32_t   STATUS_SET;                   /**< Status register                                    */
  __IOM uint32_t  IF_SET;                       /**< RTCC Interrupt Flags                               */
  __IOM uint32_t  IEN_SET;                      /**< Interrupt Enable Register                          */
  __IOM uint32_t  PRECNT_SET;                   /**< Pre-Counter Value Register                         */
  __IOM uint32_t  CNT_SET;                      /**< Counter Value Register                             */
  __IM uint32_t   COMBCNT_SET;                  /**< Combined Pre-Counter and Counter Valu...           */
  __IM uint32_t   SYNCBUSY_SET;                 /**< Synchronization Busy Register                      */
  __IOM uint32_t  LOCK_SET;                     /**< Configuration Lock Register                        */
  RTCC_CC_TypeDef CC_SET[3U];                   /**< Capture/Compare Channel                            */
  uint32_t        RESERVED1[1003U];             /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_CLR;                /**< IP VERSION                                         */
  __IOM uint32_t  EN_CLR;                       /**< Module Enable Register                             */
  __IOM uint32_t  CFG_CLR;                      /**< Configuration Register                             */
  __IOM uint32_t  CMD_CLR;                      /**< Command Register                                   */
  __IM uint32_t   STATUS_CLR;                   /**< Status register                                    */
  __IOM uint32_t  IF_CLR;                       /**< RTCC Interrupt Flags                               */
  __IOM uint32_t  IEN_CLR;                      /**< Interrupt Enable Register                          */
  __IOM uint32_t  PRECNT_CLR;                   /**< Pre-Counter Value Register                         */
  __IOM uint32_t  CNT_CLR;                      /**< Counter Value Register                             */
  __IM uint32_t   COMBCNT_CLR;                  /**< Combined Pre-Counter and Counter Valu...           */
  __IM uint32_t   SYNCBUSY_CLR;                 /**< Synchronization Busy Register                      */
  __IOM uint32_t  LOCK_CLR;                     /**< Configuration Lock Register                        */
  RTCC_CC_TypeDef CC_CLR[3U];                   /**< Capture/Compare Channel                            */
  uint32_t        RESERVED2[1003U];             /**< Reserved for future use                            */
  __IM uint32_t   IPVERSION_TGL;                /**< IP VERSION                                         */
  __IOM uint32_t  EN_TGL;                       /**< Module Enable Register                             */
  __IOM uint32_t  CFG_TGL;                      /**< Configuration Register                             */
  __IOM uint32_t  CMD_TGL;                      /**< Command Register                                   */
  __IM uint32_t   STATUS_TGL;                   /**< Status register                                    */
  __IOM uint32_t  IF_TGL;                       /**< RTCC Interrupt Flags                               */
  __IOM uint32_t  IEN_TGL;                      /**< Interrupt Enable Register                          */
  __IOM uint32_t  PRECNT_TGL;                   /**< Pre-Counter Value Register                         */
  __IOM uint32_t  CNT_TGL;                      /**< Counter Value Register                             */
  __IM uint32_t   COMBCNT_TGL;                  /**< Combined Pre-Counter and Counter Valu...           */
  __IM uint32_t   SYNCBUSY_TGL;                 /**< Synchronization Busy Register                      */
  __IOM uint32_t  LOCK_TGL;                     /**< Configuration Lock Register                        */
  RTCC_CC_TypeDef CC_TGL[3U];                   /**< Capture/Compare Channel                            */
} RTCC_TypeDef;
